<template>
  <container class="policy__container">
    <h2 class="policy__heading">
      Политика проекта в отношении обработки персональных данных.
    </h2>
    <ol class="policy__terms">
      <li class="policy__article" v-for="article in articles" :key="article.id">
        <h3 class="policy__subtitle">{{ article.name }}</h3>
        <div
          :class="{
            'policy__article-text': article.articleText !== '',
            'policy__article-gap': article.articleText == '',
          }"
          v-html="article.articleText"
        ></div>
        <ol class="policy__subsection">
          <li
            class="policy__subsection-text"
            v-for="subsection in article.subsections"
            :key="subsection.id"
          >
            {{ subsection.subsectionText }}
          </li>
        </ol>
      </li>
    </ol>
  </container>
</template>

<script>
import Container from '@/components/Container';
export default {
  components: {
    container: Container,
  },
  data() {
    return {
      articles: [
        {
          id: '1',
          name: 'Общие положения.',
          articleText:
            '<p>Настоящая политика обработки персональных данных составлена в соответствии с требованиями Федерального закона от 27.07.2006. №152-ФЗ «О персональных данных» и определяет порядок обработки персональных данных и меры по обеспечению безопасности персональных данных Благотворительный Фонд Константина Хабенского (далее – Оператор).</p>',
          subsections: [
            {
              id: '1',
              subsectionText:
                'Оператор ставит своей важнейшей целью и условием осуществления своей деятельности соблюдение прав и свобод человека и гражданина при обработке его персональных данных, в том числе защиты прав на неприкосновенность частной жизни, личную и семейную тайну.',
            },
            {
              id: '2',
              subsectionText:
                'Настоящая политика Оператора в отношении обработки персональных данных (далее – Политика) применяется ко всей информации, которую Оператор может получить о посетителях веб-сайта http://raklechitsa.ru.',
            },
          ],
        },
        {
          id: '2',
          name: 'Основные понятия, используемые в Политике',
          articleText: '',
          subsections: [
            {
              id: '1',
              subsectionText:
                'Автоматизированная обработка персональных данных – обработка персональных данных с помощью средств вычислительной техники;',
            },
            {
              id: '2',
              subsectionText:
                'Блокирование персональных данных – временное прекращение обработки персональных данных (за исключением случаев, если обработка необходима для уточнения персональных данных);',
            },
            {
              id: '3',
              subsectionText:
                'Веб-сайт – совокупность графических и информационных материалов, а также программ для ЭВМ и баз данных, обеспечивающих их доступность в сети интернет по сетевому адресу http://raklechitsa.ru;',
            },
            {
              id: '4',
              subsectionText:
                'Информационная система персональных данных — совокупность содержащихся в базах данных персональных данных, и обеспечивающих их обработку информационных технологий и технических средств;',
            },
            {
              id: '5',
              subsectionText:
                'Обезличивание персональных данных — действия, в результате которых невозможно определить без использования дополнительной информации принадлежность персональных данных конкретному Пользователю или иному субъекту персональных данных;',
            },
            {
              id: '6',
              subsectionText:
                'Обработка персональных данных – любое действие (операция) или совокупность действий (операций), совершаемых с использованием средств автоматизации или без использования таких средств с персональными данными, включая сбор, запись, систематизацию, накопление, хранение, уточнение (обновление, изменение), извлечение, использование, передачу (распространение, предоставление, доступ), обезличивание, блокирование, удаление, уничтожение персональных данных;',
            },
            {
              id: '7',
              subsectionText:
                'Оператор – государственный орган, муниципальный орган, юридическое или физическое лицо, самостоятельно или совместно с другими лицами организующие и (или) осуществляющие обработку персональных данных, а также определяющие цели обработки персональных данных, состав персональных данных, подлежащих обработке, действия (операции), совершаемые с персональными данными;',
            },
            {
              id: '8',
              subsectionText:
                'Персональные данные – любая информация, относящаяся прямо или косвенно к определенному или определяемому Пользователю веб-сайта http://raklechitsa.ru;',
            },
            {
              id: '9',
              subsectionText:
                'Пользователь – любой посетитель веб-сайта http://raklechitsa.ru;',
            },
            {
              id: '10',
              subsectionText:
                'Предоставление персональных данных – действия, направленные на раскрытие персональных данных определенному лицу или определенному кругу лиц;',
            },
            {
              id: '11',
              subsectionText:
                'Распространение персональных данных – любые действия, направленные на раскрытие персональных данных неопределенному кругу лиц (передача персональных данных) или на ознакомление с персональными данными неограниченного круга лиц, в том числе обнародование персональных данных в средствах массовой информации, размещение в информационно-телекоммуникационных сетях или предоставление доступа к персональным данным каким-либо иным способом;',
            },
            {
              id: '12',
              subsectionText:
                'Трансграничная передача персональных данных – передача персональных данных на территорию иностранного государства органу власти иностранного государства, иностранному физическому или иностранному юридическому лицу;',
            },
            {
              id: '13',
              subsectionText:
                'Уничтожение персональных данных – любые действия, в результате которых персональные данные уничтожаются безвозвратно с невозможностью дальнейшего восстановления содержания персональных данных в информационной системе персональных данных и (или) результате которых уничтожаются материальные носители персональных данных.',
            },
          ],
        },
        {
          id: '3',
          name:
            'Оператор может обрабатывать следующие персональные данные Пользователя',
          articleText: '',
          subsections: [
            {
              id: '1',
              subsectionText: 'Фамилия, имя, отчество;',
            },
            {
              id: '2',
              subsectionText: 'Электронный адрес;',
            },
            {
              id: '3',
              subsectionText: 'Номера телефонов;',
            },
            {
              id: '4',
              subsectionText: 'Год, месяц, дата и место рождения;',
            },
            {
              id: '5',
              subsectionText: 'Фотографии;',
            },
            {
              id: '6',
              subsectionText:
                'Также на сайте происходит сбор и обработка обезличенных данных о посетителях (в т.ч. файлов «cookie») с помощью сервисов интернет-статистики (Яндекс Метрика и Гугл Аналитика и других).',
            },
            {
              id: '7',
              subsectionText:
                'Вышеперечисленные данные далее по тексту Политики объединены общим понятием Персональные данные.',
            },
          ],
        },
        {
          id: '4',
          name: 'Цели обработки персональных данных',
          articleText: '',
          subsections: [
            {
              id: '1',
              subsectionText:
                'Цель обработки персональных данных Пользователя — использование персональных данных Пользователя для публикаций на сайте.',
            },
            {
              id: '2',
              subsectionText:
                'Также Оператор имеет право направлять Пользователю уведомления о новых продуктах и услугах, специальных предложениях и различных событиях. Пользователь всегда может отказаться от получения информационных сообщений, направив Оператору письмо на адрес электронной почты raklechitsa@bfkh.ru с пометкой «Отказ от уведомлениях о новых продуктах и услугах и специальных предложениях».',
            },
            {
              id: '3',
              subsectionText:
                'Обезличенные данные Пользователей, собираемые с помощью сервисов интернет-статистики, служат для сбора информации о действиях Пользователей на сайте, улучшения качества сайта и его содержания.',
            },
          ],
        },
        {
          id: '5',
          name: 'Правовые основания обработки персональных данных',
          articleText: '',
          subsections: [
            {
              id: '1',
              subsectionText:
                'Оператор обрабатывает персональные данные Пользователя только в случае их заполнения и/или отправки Пользователем самостоятельно через специальные формы, расположенные на сайте http://raklechitsa.ru. Заполняя соответствующие формы и/или отправляя свои персональные данные Оператору, Пользователь выражает свое согласие с данной Политикой.',
            },
            {
              id: '2',
              subsectionText:
                'Оператор обрабатывает обезличенные данные о Пользователе в случае, если это разрешено в настройках браузера Пользователя (включено сохранение файлов «cookie» и использование технологии JavaScript).',
            },
          ],
        },
        {
          id: '6',
          name:
            'Порядок сбора, хранения, передачи и других видов обработки персональных данных',
          articleText:
            '<p>Безопасность персональных данных, которые обрабатываются Оператором, обеспечивается путем реализации правовых, организационных и технических мер, необходимых для выполнения в полном объеме требований действующего законодательства в области защиты персональных данных.<p>',
          subsections: [
            {
              id: '1',
              subsectionText:
                'Оператор обеспечивает сохранность персональных данных и принимает все возможные меры, исключающие доступ к персональным данным неуполномоченных лиц.',
            },
            {
              id: '2',
              subsectionText:
                'Персональные данные Пользователя никогда, ни при каких условиях не будут переданы третьим лицам, за исключением случаев, связанных с исполнением действующего законодательства.',
            },
            {
              id: '3',
              subsectionText:
                'В случае выявления неточностей в персональных данных, Пользователь может актуализировать их самостоятельно, путем направления Оператору уведомление на адрес электронной почты Оператора raklechitsa@bfkh.ru с пометкой «Актуализация персональных данных».',
            },
            {
              id: '4',
              subsectionText:
                'Срок обработки персональных данных является неограниченным. Пользователь может в любой момент отозвать свое согласие на обработку персональных данных, направив Оператору уведомление посредством электронной почты на электронный адрес Оператора raklechitsa@bfkh.ru с пометкой «Отзыв согласия на обработку персональных данных».',
            },
          ],
        },
        {
          id: '7',
          name: 'Трансграничная передача персональных данных',
          articleText: '',
          subsections: [
            {
              id: '1',
              subsectionText:
                'Оператор до начала осуществления трансграничной передачи персональных данных обязан убедиться в том, что иностранным государством, на территорию которого предполагается осуществлять передачу персональных данных, обеспечивается надежная защита прав субъектов персональных данных.',
            },
            {
              id: '2',
              subsectionText:
                'Трансграничная передача персональных данных на территории иностранных государств, не отвечающих вышеуказанным требованиям, может осуществляться только в случае наличия согласия в письменной форме субъекта персональных данных на трансграничную передачу его персональных данных и/или исполнения договора, стороной которого является субъект персональных данных.',
            },
          ],
        },
        {
          id: '8',
          name: 'Заключительные положения',
          articleText: '',
          subsections: [
            {
              id: '1',
              subsectionText:
                'Пользователь может получить любые разъяснения по интересующим вопросам, касающимся обработки его персональных данных, обратившись к Оператору с помощью электронной почты raklechitsa@bfkh.ru.',
            },
            {
              id: '2',
              subsectionText:
                'В данном документе будут отражены любые изменения политики обработки персональных данных Оператором. Политика действует бессрочно до замены ее новой версией.',
            },
            {
              id: '3',
              subsectionText:
                'Актуальная версия Политики в свободном доступе расположена в сети Интернет по адресу http://raklechitsa.ru/policy.',
            },
          ],
        },
      ],
    };
  },
};
</script>

<style scoped>
.policy__container {
  max-width: 780px;
  margin: 0 auto;
}

.policy__heading {
  font-size: 38px;
  line-height: 48px;
  text-align: center;
  margin: 100px auto;
  padding: 30px 0;
  border-top: 1px solid #efefef;
  border-bottom: 1px solid #efefef;
}

.policy__terms {
  list-style-type: none;
  counter-reset: article-num;
  margin: 0;
  padding: 0;
  list-style-position: inside;
  font-size: 22px;
  line-height: 30px;
}

.policy__article {
  margin-bottom: 90px;
}

.policy__article::before {
  counter-increment: article-num;
  content: counter(article-num) '.';
  font-weight: 600;
  margin-right: 5px;
}

.policy__subtitle {
  font-size: 22px;
  line-height: 30px;
  font-weight: 600;
  margin: 0 0 40px;
  display: inline;
}

.policy__article-text {
  margin: 40px 0 30px;
}

.policy__article-gap {
  margin-top: 40px;
}

.policy__subsection {
  list-style-type: none;
  counter-reset: subsection-num;
}

.policy__subsection-text {
  margin: 0 0 30px;
  position: relative;
}

.policy__subsection-text::before {
  counter-increment: subsection-num;
  content: counter(subsection-num) '.';
  position: absolute;
  top: 0;
  left: -40px;
}

@media screen and (max-width: 1429px) {
  .policy__container {
    max-width: 700px;
    margin: 0 auto;
  }

  .policy__heading {
    font-size: 34px;
    line-height: 44px;
    margin: 90px auto;
  }

  .policy__terms {
    font-size: 20px;
    line-height: 28px;
  }

  .policy__subtitle {
    font-size: 20px;
    line-height: 28px;
  }
}

@media screen and (max-width: 1279px) {
  .policy__container {
    max-width: 640px;
    margin: 0 auto;
  }

  .policy__heading {
    font-size: 30px;
    line-height: 38px;
    margin: 80px auto;
  }

  .policy__terms {
    font-size: 18px;
    line-height: 27px;
  }

  .policy__article {
    margin-bottom: 40px;
  }

  .policy__subtitle {
    font-size: 18px;
    line-height: 27px;
  }
}

@media screen and (max-width: 670px) {
  .policy__container {
    max-width: 640px;
    margin: 0 15px;
  }

  .policy__heading {
    font-size: 18px;
    line-height: 21px;
    margin: 50px auto;
    padding: 20px 0;
  }

  .policy__terms {
    font-size: 13px;
    line-height: 16px;
  }

  .policy__article-text {
    margin: 20px 0;
  }

  .policy__article-gap {
    margin-top: 40px;
  }

  .policy__subtitle {
    font-size: 13px;
    line-height: 16px;
  }

  .policy__subsection {
    padding-left: 26px;
  }

  .policy__subsection-text::before {
    left: -26px;
  }
}
</style>
